from api.utils.format_utils import table_format
from src.api.settings import config
from src.api.utils.work_weixin_bot import send_text

# 数据：一个包含多个子列表的列表，每个子列表代表一行
data = [
    ["门店编码", "差异", "订单中心", "dws"],
    ["615032", "31.00", "392.36", "361.36"],
    ["158237", "29.43", "53.10", "23.67"],
    ["610126", "23.40", "358.60", "335.20"],
    ["318412", "22.69", "47.38", "24.69"],
    ["610033", "12.50", "56.30", "43.80"],
    ["371298", "11.90", "274.80", "262.90"],
    ["410642", "11.90", "59.50", "47.60"],
    ["140067", "9.90", "191.10", "181.20"],
    ["323179", "9.10", "161.06", "151.96"],
    ["140707", "7.60", "89.67", "82.07"],
]

title = "统计测试"
text = table_format(title, data)


send_text(config.wechat.wechat_personal_alarm, text, ["@李继聪"])
